app/views/contacts/_directory_sidebar.html.erb

    <ul>
      <% Group.order(:name).each do |group| %>
---
SELECT `groups`.* FROM `groups` ORDER BY name