app/views/contacts/_form.html.erb

SELECT `groups`.* FROM `groups`
SELECT `groups`.* FROM `groups` INNER JOIN `contact_groups` ON `groups`.id = `contact_groups`.group_id WHERE ((`contact_groups`.contact_id = 3))
---
  <div class="field">
    <% for group in Group.all %>
      <%= check_box_tag "contact[group_ids][]", group.id, @contact.groups.include?(group) %>