app/controllers/contacts_controller.rb

  def removed
    @contacts = Contact.where(:active => false).order(:name)
---
SELECT `contacts`.* FROM `contacts` WHERE `contacts`.`active` = 0 ORDER BY name