app/controllers/contacts_controller.rb

SELECT `contacts`.* FROM `contacts` WHERE (name like '%chen%')
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 2 LIMIT 1
SELECT `contacts`.* FROM `contacts` INNER JOIN `relationships` ON `contacts`.id = `relationships`.contact_id WHERE ((`relationships`.user_id = 1) AND ((`contacts`.`active` = 1)))
---
  def index
    if params[:search]
      contact_alias = Contact.search(params[:search])
      @contacts = contact_alias.page(params[:page]).per(5)
    elsif params[:group_id]
      @group = Group.find(params[:group_id])
      contact_alias = @group.contacts.active
      @contacts = contact_alias.page(params[:page]).per(5)

INSERT INTO `contacts` (`user_id`, `name`, `gender`, `cell_phone`, `work_phone`, `birthday`, `email`, `website`, `business_name`, `business_description`, `business_phone`, `business_website`, `about`, `status`, `photo_file_name`, `photo_content_type`, `photo_fingerprint`, `photo_file_size`, `photo_updated_at`, `created_at`, `updated_at`, `address_line_1`, `address_line_2`, `city`, `state`, `zip`, `newcomer`, `member`, `staff`, `elder`, `deacon`) VALUES (NULL, 'Chu Deng', 'Male', '1234556677', '', NULL, 'chudeng@test.com', '', NULL, NULL, NULL, NULL, '', NULL, NULL, NULL, NULL, NULL, NULL, '2011-04-26 20:50:40', '2011-04-26 20:50:40', '', '', '', '', '', 0, 0, 0, 0, 0)
---
  def create
    if @contact.save

UPDATE `contacts` SET `work_phone` = '', `address_line_1` = '', `address_line_2` = '', `city` = '', `state` = '', `zip` = '', `birthday` = '1980-01-22 00:00:00', `member` = 1, `status` = '', `website` = '', `about` = '', `updated_at` = '2011-04-21 18:42:18' WHERE `contacts`.`id` = 1
---
  def update
    params[:contact][:group_ids] ||= []
    params[:contact][:status_ids] ||= []

    @contact.family_id = nil if params[:family_name].blank?
    if @contact.update_attributes(params[:contact])

SELECT `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 4 LIMIT 1
UPDATE `contacts` SET `active` = 0, `updated_at` = '2011-04-28 22:01:46' WHERE `contacts`.`id` = 4
---
  def remove
    @contact = Contact.find(params[:id])
    if @contact.update_attribute :active, false

SELECT `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 4 LIMIT 1
UPDATE `contacts` SET `active` = 1, `updated_at` = '2011-04-28 22:54:22' WHERE `contacts`.`id` = 4
---
  def activate
    @contact = Contact.find(params[:id])
    if @contact.update_attribute :active, true