app/controllers/groups_controller.rb

INSERT INTO `groups` (`name`, `created_at`, `updated_at`) VALUES ('Cantonese Adult Fellowship', '2011-04-26 17:29:42', '2011-04-26 17:29:42')
---
  def create
    respond_to do |format|
      if @group.save

DELETE FROM `groups` WHERE `groups`.`id` = 1
---
  def destroy
    @group.destroy