app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE (id != 1) ORDER BY admin DESC, name
---
  def index
    @users = User.where(["id != ?", current_user.id]).active

SELECT `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 5 LIMIT 1
SELECT `contacts`.`id` FROM `contacts` WHERE (`contacts`.`email` = BINARY 'adam@gmail.com') AND (`contacts`.id <> 4) LIMIT 1
SELECT `users`.`id` FROM `users` WHERE (`users`.`email` = BINARY 'johannchen@gmail.com') LIMIT 1
INSERT INTO `users` (`email`, `password_hash`, `password_salt`, `created_at`, `updated_at`, `name`, `admin`) VALUES ('chudeng@test.com', '$2a$10$yVJ2w2RLihrnNSMHvUhXSuHkeY.9rJraZOuecraRRTzIQaXqqTjPq', '$2a$10$yVJ2w2RLihrnNSMHvUhXSu', '2011-04-28 18:29:01', '2011-04-28 18:29:01', 'Chu Deng', NULL)
UPDATE `contacts` SET `user_id` = 7, `updated_at` = '2011-04-28 18:53:46' WHERE `contacts`.`id` = 4
---
  def create
    # pre populate name and email from selected contact
    contact = Contact.find(params[:contact][:id])
    @user = User.new(:first_name => contact.first_name, :last_name => contact.last_name, :email => contact.email, :admin => params[:user][:admin])
    # random auto generate password
    @user.new_random_password
    if @user.save
      # assign contact to user
      contact.update_attribute :user_id, @user.id

UPDATE `users` SET `name` = 'Johann Chen', `password_salt` = '$2a$10$TqcwmwA1gMGk9kzi7puSve', `password_hash` = '$2a$10$TqcwmwA1gMGk9kzi7puSveRbgjcRHAeIsT4x1TmqlHxLYxQ6Rn6J6', `updated_at` = '2011-04-19 22:43:42' WHERE `users`.`id` = 1
---
  def update
    params[:user].delete(:admin) unless current_user.admin
    params[:user].delete(:password) if params[:user][:password].blank?
    respond_to do |format|
      if @user.update_attributes(params[:user])

UPDATE `contacts` SET `user_id` = NULL, `updated_at` = '2011-04-28 20:40:43' WHERE `contacts`.`id` = 4
DELETE FROM `users` WHERE `users`.`id` = 7
---
  def destroy
    if contact = @user.contact
      contact.update_attribute :user_id, nil
    end
    @user.destroy