app/controllers/users_controller.rb

  def new
    @contacts = Contact.where("user_id is null  and email is not null").order("name")
---
SELECT `contacts`.* FROM `contacts` WHERE (user_id is null and email is not null) ORDER BY name